cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "ghq"
brew "git"
brew "jq"
brew "mas"
brew "nkf"
brew "nvim"
brew "pyenv"
brew "pipenv"
brew "poetry"
brew "tmux"
brew "zsh"
brew "zplug"

cask "alfred"
cask "docker"
cask "dropbox"
cask "font-ricty-diminished"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "visual-studio-code"
cask "zoomus"

mas "1Password", id: 443987910
mas "2Do", id: 477670270
mas "Magnet", id: 441258766
mas "Slack", id: 803453959
mas "Xcode", id: 497799835

